InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодАдресногоОбъектаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресныйКлассификатор/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Кодировка = Константы.КодировкаДляКЛАДР.Получить();
	Если ЭтотОбъект.Количество() > 0 И Кодировка <> "" И Кодировка <> "ANSI" И Кодировка <> "OEM"
			И Не (ЭтотОбъект.Отбор[0].Использование И ЭтотОбъект.Отбор[1].Использование И ЭтотОбъект.Отбор[2].Использование
				И ЭтотОбъект.Отбор[3].Использование И ЭтотОбъект.Отбор[4].Использование И ЭтотОбъект.Отбор[5].Использование 
				И ЭтотОбъект.Отбор[6].Использование) Тогда	
		Путь = ПолучитьИмяВременногоФайла();	
		ТД = Новый ТекстовыйДокумент();	
		Для Каждого Стр Из ЭтотОбъект Цикл
			ТД.ДобавитьСтроку(Стр.Наименование);
			ТД.ДобавитьСтроку(Стр.Сокращение);
			ТД.ДобавитьСтроку(Стр.Индекс);
			ТД.ДобавитьСтроку(Стр.АльтернативныеНазвания);
		КонецЦикла;
		ТД.Записать(Путь, КодировкаТекста.OEM, Символы.ВК);
		ТД.Прочитать(Путь, Кодировка, Символы.ВК);
		
		й = 1;
		Для Каждого Стр Из ЭтотОбъект Цикл
			Стр.Наименование = ТД.ПолучитьСтроку(й);
			Стр.Сокращение = ТД.ПолучитьСтроку(й + 1);
			Стр.Индекс = ТД.ПолучитьСтроку(й + 2);
			Стр.АльтернативныеНазвания = ТД.ПолучитьСтроку(й + 3);
			й = й + 4;
		КонецЦикла;
		
		Файл = Новый Файл(Путь);
		Если Файл.Существует() Тогда
			УдалитьФайлы(Файл.ПолноеИмя, Файл.Имя);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
